program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func infer<ios18>(tensor<fp16, [1, 1, 1, 2048]> causal_mask, tensor<int32, [1]> current_pos, tensor<fp16, [1, 1, 2048]> hidden_states, state<tensor<fp16, [56, 8, 2048, 128]>> model_model_kv_cache_0, tensor<int32, [1]> position_ids) {
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_14_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(64))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(3145856))))[name = string("model_model_layers_14_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_14_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(3211456))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4784384))))[name = string("model_model_layers_14_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_14_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4817216))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(6390144))))[name = string("model_model_layers_14_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_14_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(6422976))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15860224))))[name = string("model_model_layers_14_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_14_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16056896))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25494144))))[name = string("model_model_layers_14_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_14_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25690816))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(35128064))))[name = string("model_model_layers_14_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_15_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(35193664))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(38339456))))[name = string("model_model_layers_15_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_15_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(38405056))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(39977984))))[name = string("model_model_layers_15_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_15_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(40010816))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41583744))))[name = string("model_model_layers_15_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_15_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(41616576))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(51053824))))[name = string("model_model_layers_15_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_15_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(51250496))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(60687744))))[name = string("model_model_layers_15_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_15_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(60884416))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(70321664))))[name = string("model_model_layers_15_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_16_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(70387264))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(73533056))))[name = string("model_model_layers_16_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_16_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(73598656))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(75171584))))[name = string("model_model_layers_16_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_16_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(75204416))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(76777344))))[name = string("model_model_layers_16_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_16_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(76810176))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(86247424))))[name = string("model_model_layers_16_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_16_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(86444096))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(95881344))))[name = string("model_model_layers_16_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_16_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(96078016))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(105515264))))[name = string("model_model_layers_16_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_17_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(105580864))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(108726656))))[name = string("model_model_layers_17_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_17_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(108792256))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(110365184))))[name = string("model_model_layers_17_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_17_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(110398016))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(111970944))))[name = string("model_model_layers_17_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_17_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(112003776))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(121441024))))[name = string("model_model_layers_17_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_17_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(121637696))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(131074944))))[name = string("model_model_layers_17_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_17_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(131271616))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(140708864))))[name = string("model_model_layers_17_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_18_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(140774464))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(143920256))))[name = string("model_model_layers_18_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_18_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(143985856))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(145558784))))[name = string("model_model_layers_18_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_18_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(145591616))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(147164544))))[name = string("model_model_layers_18_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_18_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(147197376))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(156634624))))[name = string("model_model_layers_18_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_18_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(156831296))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(166268544))))[name = string("model_model_layers_18_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_18_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(166465216))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(175902464))))[name = string("model_model_layers_18_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_19_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(175968064))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(179113856))))[name = string("model_model_layers_19_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_19_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(179179456))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(180752384))))[name = string("model_model_layers_19_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_19_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(180785216))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(182358144))))[name = string("model_model_layers_19_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_19_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(182390976))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(191828224))))[name = string("model_model_layers_19_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_19_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(192024896))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(201462144))))[name = string("model_model_layers_19_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_19_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(201658816))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(211096064))))[name = string("model_model_layers_19_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_20_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(211161664))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(214307456))))[name = string("model_model_layers_20_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_20_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(214373056))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(215945984))))[name = string("model_model_layers_20_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_20_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(215978816))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(217551744))))[name = string("model_model_layers_20_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_20_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(217584576))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(227021824))))[name = string("model_model_layers_20_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_20_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(227218496))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(236655744))))[name = string("model_model_layers_20_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_20_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(236852416))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(246289664))))[name = string("model_model_layers_20_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_21_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(246355264))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(249501056))))[name = string("model_model_layers_21_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_21_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(249566656))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(251139584))))[name = string("model_model_layers_21_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_21_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(251172416))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(252745344))))[name = string("model_model_layers_21_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_21_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(252778176))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(262215424))))[name = string("model_model_layers_21_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_21_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(262412096))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(271849344))))[name = string("model_model_layers_21_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_21_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(272046016))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(281483264))))[name = string("model_model_layers_21_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_22_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(281548864))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(284694656))))[name = string("model_model_layers_22_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_22_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(284760256))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(286333184))))[name = string("model_model_layers_22_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_22_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(286366016))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(287938944))))[name = string("model_model_layers_22_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_22_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(287971776))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(297409024))))[name = string("model_model_layers_22_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_22_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(297605696))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(307042944))))[name = string("model_model_layers_22_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_22_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(307239616))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(316676864))))[name = string("model_model_layers_22_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_23_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(316742464))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(319888256))))[name = string("model_model_layers_23_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_23_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(319953856))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(321526784))))[name = string("model_model_layers_23_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_23_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(321559616))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(323132544))))[name = string("model_model_layers_23_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_23_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(323165376))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(332602624))))[name = string("model_model_layers_23_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_23_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(332799296))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(342236544))))[name = string("model_model_layers_23_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_23_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(342433216))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(351870464))))[name = string("model_model_layers_23_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_24_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(351936064))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(355081856))))[name = string("model_model_layers_24_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_24_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(355147456))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(356720384))))[name = string("model_model_layers_24_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_24_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(356753216))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(358326144))))[name = string("model_model_layers_24_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_24_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(358358976))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(367796224))))[name = string("model_model_layers_24_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_24_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(367992896))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(377430144))))[name = string("model_model_layers_24_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_24_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(377626816))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(387064064))))[name = string("model_model_layers_24_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_25_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(387129664))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(390275456))))[name = string("model_model_layers_25_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_25_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(390341056))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(391913984))))[name = string("model_model_layers_25_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_25_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(391946816))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(393519744))))[name = string("model_model_layers_25_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_25_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(393552576))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(402989824))))[name = string("model_model_layers_25_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_25_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(403186496))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(412623744))))[name = string("model_model_layers_25_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_25_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(412820416))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(422257664))))[name = string("model_model_layers_25_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_26_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(422323264))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(425469056))))[name = string("model_model_layers_26_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_26_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(425534656))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(427107584))))[name = string("model_model_layers_26_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_26_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(427140416))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(428713344))))[name = string("model_model_layers_26_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_26_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(428746176))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(438183424))))[name = string("model_model_layers_26_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_26_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(438380096))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(447817344))))[name = string("model_model_layers_26_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_26_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(448014016))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(457451264))))[name = string("model_model_layers_26_mlp_down_proj_weight_palettized")];
            tensor<fp16, [2048, 2048, 1, 1]> model_model_layers_27_self_attn_q_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(457516864))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(460662656))))[name = string("model_model_layers_27_self_attn_q_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_27_self_attn_k_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(460728256))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(462301184))))[name = string("model_model_layers_27_self_attn_k_proj_weight_palettized")];
            tensor<fp16, [1024, 2048, 1, 1]> model_model_layers_27_self_attn_v_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [1024, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(462334016))), lut = tensor<fp16, [256, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(463906944))))[name = string("model_model_layers_27_self_attn_v_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_27_mlp_gate_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(463939776))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(473377024))))[name = string("model_model_layers_27_mlp_gate_proj_weight_palettized")];
            tensor<fp16, [6144, 2048, 1, 1]> model_model_layers_27_mlp_up_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [6144, 2048, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(473573696))), lut = tensor<fp16, [1536, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(483010944))))[name = string("model_model_layers_27_mlp_up_proj_weight_palettized")];
            tensor<fp16, [2048, 6144, 1, 1]> model_model_layers_27_mlp_down_proj_weight_palettized = constexpr_lut_to_dense(indices = tensor<uint6, [2048, 6144, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(483207616))), lut = tensor<fp16, [512, 1, 1, 1, 64, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(492644864))))[name = string("model_model_layers_27_mlp_down_proj_weight_palettized")];
            int32 var_761_batch_dims_0 = const()[name = string("op_761_batch_dims_0"), val = int32(0)];
            bool var_761_validate_indices_0 = const()[name = string("op_761_validate_indices_0"), val = bool(false)];
            tensor<fp16, [1, 4096, 128]> var_753_to_fp16 = const()[name = string("op_753_to_fp16"), val = tensor<fp16, [1, 4096, 128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(492710464)))];
            string current_pos_to_int16_dtype_0 = const()[name = string("current_pos_to_int16_dtype_0"), val = string("int16")];
            string cast_118_dtype_0 = const()[name = string("cast_118_dtype_0"), val = string("int32")];
            int32 greater_equal_0_y_0 = const()[name = string("greater_equal_0_y_0"), val = int32(0)];
            tensor<int16, [1]> current_pos_to_int16 = cast(dtype = current_pos_to_int16_dtype_0, x = current_pos)[name = string("cast_5")];
            tensor<int32, [1]> cast_118 = cast(dtype = cast_118_dtype_0, x = current_pos_to_int16)[name = string("cast_4")];
            tensor<bool, [1]> greater_equal_0 = greater_equal(x = cast_118, y = greater_equal_0_y_0)[name = string("greater_equal_0")];
            int32 slice_by_index_0 = const()[name = string("slice_by_index_0"), val = int32(4096)];
            tensor<int32, [1]> add_0 = add(x = cast_118, y = slice_by_index_0)[name = string("add_0")];
            tensor<int32, [1]> select_0 = select(a = cast_118, b = add_0, cond = greater_equal_0)[name = string("select_0")];
            string select_0_to_int16_dtype_0 = const()[name = string("select_0_to_int16_dtype_0"), val = string("int16")];
            string cast_0_dtype_0 = const()[name = string("cast_0_dtype_0"), val = string("int32")];
            int32 greater_equal_0_y_0_1 = const()[name = string("greater_equal_0_y_0_1"), val = int32(0)];
            tensor<int16, [1]> select_0_to_int16 = cast(dtype = select_0_to_int16_dtype_0, x = select_0)[name = string("cast_3")];
            tensor<int32, [1]> cast_0 = cast(dtype = cast_0_dtype_0, x = select_0_to_int16)[name = string("cast_2")];
            tensor<bool, [1]> greater_equal_0_1 = greater_equal(x = cast_0, y = greater_equal_0_y_0_1)[name = string("greater_equal_0_1")];
            int32 slice_by_index_0_1 = const()[name = string("slice_by_index_0_1"), val = int32(4096)];
            tensor<int32, [1]> add_0_1 = add(x = cast_0, y = slice_by_index_0_1)[name = string("add_0_1")];
            tensor<int32, [1]> select_0_1 = select(a = cast_0, b = add_0_1, cond = greater_equal_0_1)[name = string("select_0_1")];
            int32 op_761_cast_fp16_cast_uint16_cast_uint16_axis_0 = const()[name = string("op_761_cast_fp16_cast_uint16_cast_uint16_axis_0"), val = int32(1)];
            tensor<fp16, [1, 1, 128]> op_761_cast_fp16_cast_uint16_cast_uint16 = gather(axis = op_761_cast_fp16_cast_uint16_cast_uint16_axis_0, batch_dims = var_761_batch_dims_0, indices = select_0_1, validate_indices = var_761_validate_indices_0, x = var_753_to_fp16)[name = string("op_761_cast_fp16_cast_uint16_cast_uint16")];
            tensor<int32, [4]> var_766 = const()[name = string("op_766"), val = tensor<int32, [4]>([1, 1, 1, -1])];
            tensor<fp16, [1, 1, 1, 128]> sin_1_cast_fp16 = reshape(shape = var_766, x = op_761_cast_fp16_cast_uint16_cast_uint16)[name = string("sin_1_cast_fp16")];
            int32 var_776_axis_0 = const()[name = string("op_776_axis_0"), val = int32(1)];
            int32 var_776_batch_dims_0 = const()[name = string("op_776_batch_dims_0"), val = int32(0)];
            bool var_776_validate_indices_0 = const()[name = string("op_776_validate_indices_0"), val = bool(false)];
            tensor<fp16, [1, 4096, 128]> var_768_to_fp16 = const()[name = string("op_768_to_fp16"), val = tensor<fp16, [1, 4096, 128]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(493759104)))];
            string current_pos_to_uint16_dtype_0 = const()[name = string("current_pos_to_uint16_dtype_0"), val = string("uint16")];
            tensor<uint16, [1]> current_pos_to_uint16 = cast(dtype = current_pos_to_uint16_dtype_0, x = current_pos)[name = string("cast_1")];
            tensor<fp16, [1, 1, 128]> var_776_cast_fp16_cast_uint16 = gather(axis = var_776_axis_0, batch_dims = var_776_batch_dims_0, indices = current_pos_to_uint16, validate_indices = var_776_validate_indices_0, x = var_768_to_fp16)[name = string("op_776_cast_fp16_cast_uint16")];
            tensor<int32, [4]> var_781 = const()[name = string("op_781"), val = tensor<int32, [4]>([1, 1, 1, -1])];
            tensor<fp16, [1, 1, 1, 128]> cos_1_cast_fp16 = reshape(shape = var_781, x = var_776_cast_fp16_cast_uint16)[name = string("cos_1_cast_fp16")];
            int32 var_802 = const()[name = string("op_802"), val = int32(-1)];
            fp16 const_0_promoted_to_fp16 = const()[name = string("const_0_promoted_to_fp16"), val = fp16(-0x1p+0)];
            tensor<fp16, [1, 1, 2048]> var_804_cast_fp16 = mul(x = hidden_states, y = const_0_promoted_to_fp16)[name = string("op_804_cast_fp16")];
            bool input_1_interleave_0 = const()[name = string("input_1_interleave_0"), val = bool(false)];
            tensor<fp16, [1, 1, 4096]> input_1_cast_fp16 = concat(axis = var_802, interleave = input_1_interleave_0, values = (hidden_states, var_804_cast_fp16))[name = string("input_1_cast_fp16")];
            tensor<int32, [1]> normed_1_axes_0 = const()[name = string("normed_1_axes_0"), val = tensor<int32, [1]>([-1])];
            fp16 var_799_to_fp16 = const()[name = string("op_799_to_fp16"), val = fp16(0x1.1p-20)];
            tensor<fp16, [1, 1, 4096]> normed_1_cast_fp16 = layer_norm(axes = normed_1_axes_0, epsilon = var_799_to_fp16, x = input_1_cast_fp16)[name = string("normed_1_cast_fp16")];
            tensor<int32, [3]> normed_3_begin_0 = const()[name = string("normed_3_begin_0"), val = tensor<int32, [3]>([0, 0, 0])];
            tensor<int32, [3]> normed_3_end_0 = const()[name = string("normed_3_end_0"), val = tensor<int32, [3]>([1, 1, 2048])];
            tensor<bool, [3]> normed_3_end_mask_0 = const()[name = string("normed_3_end_mask_0"), val = tensor<bool, [3]>([true, true, false])];
            tensor<fp16, [1, 1, 2048]> normed_3_cast_fp16 = slice_by_index(begin = normed_3_begin_0, end = normed_3_end_0, end_mask = normed_3_end_mask_0, x = normed_1_cast_fp16)[name = string("normed_3_cast_fp16")];
            tensor<fp16, [2048]> const_3_promoted_to_fp16 = const()[name = string("const_3_promoted_to_fp16"), val = tensor<fp16, [2048]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(494807744)))];
            tensor<fp16, [1, 1, 2048]> hidden_states_3_cast_fp16 = mul(x = normed_3_cast_fp16, y = const_3_promoted_to_fp16)[name = string("hidden_states_3_cast_fp16")];
            tensor<int32, [3]> var_821 = const()[name = string("op_821"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> var_824_axes_0 = const()[name = string("op_824_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 2048, 1]> var_822_cast_fp16 = transpose(perm = var_821, x = hidden_states_3_cast_fp16)[name = string("transpose_83")];
            tensor<fp16, [1, 2048, 1, 1]> var_824_cast_fp16 = expand_dims(axes = var_824_axes_0, x = var_822_cast_fp16)[name = string("op_824_cast_fp16")];
            string var_840_pad_type_0 = const()[name = string("op_840_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> var_840_strides_0 = const()[name = string("op_840_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_840_pad_0 = const()[name = string("op_840_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_840_dilations_0 = const()[name = string("op_840_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 var_840_groups_0 = const()[name = string("op_840_groups_0"), val = int32(1)];
            tensor<fp16, [1, 2048, 1, 1]> var_840 = conv(dilations = var_840_dilations_0, groups = var_840_groups_0, pad = var_840_pad_0, pad_type = var_840_pad_type_0, strides = var_840_strides_0, weight = model_model_layers_14_self_attn_q_proj_weight_palettized, x = var_824_cast_fp16)[name = string("op_840")];
            tensor<int32, [4]> var_845 = const()[name = string("op_845"), val = tensor<int32, [4]>([1, 16, 1, 128])];
            tensor<fp16, [1, 16, 1, 128]> var_846 = reshape(shape = var_845, x = var_840)[name = string("op_846")];
            string var_862_pad_type_0 = const()[name = string("op_862_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> var_862_strides_0 = const()[name = string("op_862_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_862_pad_0 = const()[name = string("op_862_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_862_dilations_0 = const()[name = string("op_862_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 var_862_groups_0 = const()[name = string("op_862_groups_0"), val = int32(1)];
            tensor<fp16, [1, 1024, 1, 1]> var_862 = conv(dilations = var_862_dilations_0, groups = var_862_groups_0, pad = var_862_pad_0, pad_type = var_862_pad_type_0, strides = var_862_strides_0, weight = model_model_layers_14_self_attn_k_proj_weight_palettized, x = var_824_cast_fp16)[name = string("op_862")];
            tensor<int32, [4]> var_867 = const()[name = string("op_867"), val = tensor<int32, [4]>([1, 8, 1, 128])];
            tensor<fp16, [1, 8, 1, 128]> var_868 = reshape(shape = var_867, x = var_862)[name = string("op_868")];
            string var_884_pad_type_0 = const()[name = string("op_884_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> var_884_strides_0 = const()[name = string("op_884_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_884_pad_0 = const()[name = string("op_884_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_884_dilations_0 = const()[name = string("op_884_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 var_884_groups_0 = const()[name = string("op_884_groups_0"), val = int32(1)];
            tensor<fp16, [1, 1024, 1, 1]> var_884 = conv(dilations = var_884_dilations_0, groups = var_884_groups_0, pad = var_884_pad_0, pad_type = var_884_pad_type_0, strides = var_884_strides_0, weight = model_model_layers_14_self_attn_v_proj_weight_palettized, x = var_824_cast_fp16)[name = string("op_884")];
            tensor<int32, [4]> var_889 = const()[name = string("op_889"), val = tensor<int32, [4]>([1, 8, 1, 128])];
            tensor<fp16, [1, 8, 1, 128]> var_890 = reshape(shape = var_889, x = var_884)[name = string("op_890")];
            int32 var_905 = const()[name = string("op_905"), val = int32(-1)];
